# Introduction to NumPy, Pandas, and Python Analytics
Written By Trisha Shrivastava, Supplemented Material by Dr. John Bono, Modified by Sashwat Venkatesh and Samuel Galita


**Welcome to BUFN400's Python Bootcamp! In this notebook, we will cover:**

## Data Processing and Analysis in Python

### What are Pandas and NumPy?

#### A Brief Introduction to NumPy
**NumPy (or Numerical Python)** is a library that specializes in making numerical computations faster (the speed comes from the library being built in C) which allows for easy shape manipulation, descriptive statistics, sorting, and filtering. The main highlight of this library is its ndarray (n-dimensional array).

In [212]:
# import numpy (commonly aliased as np)
import numpy as np

#### A Brief Introduction to Pandas
**Pandas (or panel data)** is a library that specializes in data analysis and processing functionality for data in various forms (i.e. various data types). The highlights of this library are its series (a more advanced ndarray) and its dataframes (think excel spreadsheets in Python). 

You will find yourself using Pandas most of the time throughout the CompFin program, as it's the easiest way to store, access, and perform larger scale data calculations.

In [213]:
# import pandas (commonly aliased as pd)
import pandas as pd

### Array Arithmetic

Arrays, as previously mentioned, are known for their quick computational speed. There are two compelling arithmetic features of arrays **broadcasting** and **comparison** that can be done between arrays of compatible sizes and scalars.

In [214]:
# broadcasting example - scalar
a1 = np.array([x for x in range(10)])
a1 *= 2 #elementwise multiplication of 2
print(a1)

[ 0  2  4  6  8 10 12 14 16 18]

In [215]:
# broadcasting example - compatible arrays (1)
a = np.array([1,2,3])
b = np.array([4,5,6])

print(a+b) #elementwise addition

[5 7 9]

In [216]:
# broadcasting example - compatible arrays (2)
a = np.array([1,2,3])
c = np.array([[9,8,2],[7,1,5]])
print(c+a)

[[10 10  5]
 [ 8  3  8]]

In [217]:
# comparison example - scalar
c = np.array([[9,8,2],[7,1,5]])
print(c > 6)

[[ True  True False]
 [ True False False]]

In [218]:
# comparison example - compatible arrays
b = np.array([4,5,6])
c = np.array([[9,8,2],[7,1,5]])
print(c < b)

[[False False  True]
 [False  True  True]]

In [219]:
#Cumulative Sums and products
x = [1,2,3,4,5,6,7,8,9,10]

print("Cumulative sum array:", np.cumsum(x))
print("Cumulative product array:",np.cumprod(x))
print('--------------------')

print("True Cumulative Sum:", np.cumsum(x)[len(x)-1])
print("True Cumulative product:", np.cumprod(x)[len(x)-1])
print('--------------------')

print("Cumulative sum:", np.sum(x))
print("Cumulative product:", np.prod(x))

Cumulative sum array: [ 1  3  6 10 15 21 28 36 45 55]
Cumulative product array: [      1       2       6      24     120     720    5040   40320  362880
 3628800]
--------------------
True Cumulative Sum: 55
True Cumulative product: 3628800
--------------------
Cumulative sum: 55
Cumulative product: 3628800

In [220]:
# TRY IT YOURSELF -- create a 2 dimensional ndarray of numbers 1-6
# square all of the values 
# print out the values thats squares are at most 16

Given that Pandas is built off of NumPy, these arithmetic attributes also apply to Series and DataFrames!

### Creating a Dataframe from Collections

Let's first start playing with these libraries by creating a dataset! We are going to start off by creating a dataframe for students' grades. 

To start with, we will create structures to store the students' grades.

Function Notes:
- `np.array(collection)`
- `np.arange(start, stop, step)` - stop not inclusive [start, stop)

In [221]:
# student a - creating an array from a collection
a = np.array([80, 75, 70, 90, 98])

# student b - creating an array from a range of values 
b = np.arange(80, 105, 5) #this also equals np.array([80,85,90,95,100]) OR np.array(range(80,105,5)) - just faster :)

# student c - creating a list of values
c = [66, 75, 91, 72, 83]

Next, we will add these all together into one dataframe.

Function Notes:
- `pd.DataFrame` - creates a dataframe from a collection; can specify column names, data types, and index

In [222]:
# merging collections into one dataframe
df = pd.DataFrame({'a': a, 'b' : b, 'c' : c}, index=[1,2,3,4,5])

# display the dataframe
display(df)

    a    b   c
1  80   80  66
2  75   85  75
3  70   90  91
4  90   95  72
5  98  100  83

### Creating a Dataframe from Data Sets (csv/excel)

You can import a dataset from a csv, using `pd.read_csv()`. Using this function, you can determine what columns you want to import in list form (include the attribute usecols=[]) and what datatypes there are in dictionary form (include the attribute dtype={}).

An example anatomy of this function is:

`pd.read_csv('path + filename', usecols = ['col1','col2','col3'], dtype = {'col1': int64, 'col2': float32, 'col3': string})`

### Indexing and Modifying DataFrames

##### Indexing DataFrames

Being able to select data from each column, row, or cell is an important tool for analyzing and modifying data. 

Function Notes:
- `loc()` allows access by [row(s), column(s)] data by index and column name
- `iloc()` allows access by [row(s), column(s)] by positional row and column indices

In [223]:
msft = pd.read_csv("MSFT.csv")

msft.head()

         Date      Open      High       Low     Close  Adj Close      Volume
0  1986-03-13  0.088542  0.101563  0.088542  0.097222   0.061434  1031788800
1  1986-03-14  0.097222  0.102431  0.097222  0.100694   0.063628   308160000
2  1986-03-17  0.100694  0.103299  0.100694  0.102431   0.064725   133171200
3  1986-03-18  0.102431  0.103299  0.098958  0.099826   0.063079    67766400
4  1986-03-19  0.099826  0.100694  0.097222  0.098090   0.061982    47894400

In [224]:
# indexing a dataframe column - all of $MSFT stock prices
msft['High']

0         0.101563
1         0.102431
2         0.103299
3         0.103299
4         0.100694
           ...
9078    301.000000
9079    300.140015
9080    305.000000
9081    303.230011
9082    304.200012
Name: High, Length: 9083, dtype: float64

In [225]:
# indexing a dataframe row - first day of trading for $MSFT
# the ':' references all of the possible columns
msft.loc[0,:]

Date         1986-03-13
Open           0.088542
High           0.101563
Low            0.088542
Close          0.097222
Adj Close      0.061434
Volume       1031788800
Name: 0, dtype: object

In [226]:
# indexing a cell using .loc ($MSFT second day high price)
msft.loc[1, 'High']

0.102431

In [227]:
# indexing a cell using .iloc ($MSFT first trading day low price)
msft.iloc[0,3]

0.088542


##### Modifying DataFrames

###### **Changing Values**

Modifying data in a dataframe is as simple as it is with a list. You simply need to set the indexed value equal to the desired value.



**EXERCISE** 
Let's assume that the New York Stock Exchange had a glitch, and showed that MSFT's closing price on March 24 of the year was actually $100. Modify the DataFrame to reflect this change.

In [228]:
# TRY IT YOURSELF - change student b's first test score


# display dataframe with change
display(msft)

,Date,Open,High,Low,Close,Adj Close,Volume
0,1986-03-13,0.088542,0.101563,0.088542,0.097222,0.061434,1031788800
1,1986-03-14,0.097222,0.102431,0.097222,0.100694,0.063628,308160000
2,1986-03-17,0.100694,0.103299,0.100694,0.102431,0.064725,133171200
3,1986-03-18,0.102431,0.103299,0.098958,0.099826,0.063079,67766400
4,1986-03-19,0.099826,0.100694,0.097222,0.098090,0.061982,47894400
...,...,...,...,...,...,...,...
9078,2022-03-18,295.369995,301.000000,292.730011,300.429993,300.429993,43317000
9079,2022-03-21,298.890015,300.140015,294.899994,299.160004,299.160004,28351200
9080,2022-03-22,299.799988,305.000000,298.769989,304.059998,304.059998,27599700
9081,2022-03-23,300.510010,303.230011,297.720001,299.489990,299.489990,25715400
9082,2022-03-24,299.140015,304.200012,298.320007,304.100006,304.100006,24446900

###### **Changing Data Types**

While Python has in-built functions to view data types and wrappers to convert data types of variables, Pandas has in-built functions to convert and view entire series and/or dataframes. These functions produce a copy of the dataframe, so in order to store the changes you've made, you must set it to a variable or use inplace = True.

i.e. df = df.astype(float)

In [229]:
# view data types of each column
msft.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [230]:
# convert datatypes based on dictionary mapping
msft.astype({"Volume": 'float64'})

,Date,Open,High,Low,Close,Adj Close,Volume
0,1986-03-13,0.088542,0.101563,0.088542,0.097222,0.061434,1.031789e+09
1,1986-03-14,0.097222,0.102431,0.097222,0.100694,0.063628,3.081600e+08
2,1986-03-17,0.100694,0.103299,0.100694,0.102431,0.064725,1.331712e+08
3,1986-03-18,0.102431,0.103299,0.098958,0.099826,0.063079,6.776640e+07
4,1986-03-19,0.099826,0.100694,0.097222,0.098090,0.061982,4.789440e+07
...,...,...,...,...,...,...,...
9078,2022-03-18,295.369995,301.000000,292.730011,300.429993,300.429993,4.331700e+07
9079,2022-03-21,298.890015,300.140015,294.899994,299.160004,299.160004,2.835120e+07
9080,2022-03-22,299.799988,305.000000,298.769989,304.059998,304.059998,2.759970e+07
9081,2022-03-23,300.510010,303.230011,297.720001,299.489990,299.489990,2.571540e+07
9082,2022-03-24,299.140015,304.200012,298.320007,304.100006,304.100006,2.444690e+07

###### **Time Data**

Dealing with time can be a bit confusing because of various formatting inconsistencies, so to deal with the complexities of time Python has its own library - datetime! However, converting to datetime is not limited to just this library - NumPy and Pandas have their own capabilities too!

In [231]:
# import statement for datetime
import datetime as dt

In [232]:
# print the current time and date - datetime
x = dt.datetime.now()
print(x)
print(type(x))

2023-08-22 20:54:23.934131
<class 'datetime.datetime'>

In [233]:
# create a datetime obj - np.datetime64
y = np.datetime64('2023-08-23')
print(y)
print(type(y))

2023-08-23
<class 'numpy.datetime64'>

In [234]:
# create a datetime obj - pd.to_datetime
ser1 = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
z = pd.to_datetime(ser1)
print(z)

0   2000-03-11
1   2000-03-12
2   2000-03-13
dtype: datetime64[ns]

You can pulls specifics relating to date, such as `year`,`month`,`day`,`hour`,`minute`,`seconds`, and `microseconds`.

In [235]:
print(x.minute)

54

**Timedelta**

Timedelta is a portion of the datetime library that calculates the sum/difference of two different points in time.

*Note: When you have a negative time difference, you can use the `abs()` function in order to calculate elapsed time.

You can do this with all datetime libraries.

In [236]:
# first day of class - datetime(year,month,day,hour,minute,second,microsecond)
y = dt.datetime(2023,8,28,14)
print(y)

2023-08-28 14:00:00

In [237]:
# calculate the difference between now and the first day of class
d1 = y-x
print(d1)
print(type(d1))

5 days, 17:05:36.065869
<class 'datetime.timedelta'>

In [238]:
#displaying np.datetime64 timedelta functionality
np.datetime64('2022-08-24') - np.datetime64('2022-05-05')

numpy.timedelta64(111,'D')

###### Converting to and from Strings

An important functionality of the datetime library is its ability to convert strings to datetime objects and datetime objects to strings. This is primarily done by two functions in datetime:
- `strftime()`: converts datetime object to string
- `strptime()`: converts string to datetime object

While there are library specific functions to convert NumPy and Pandas datetime objects to strings, the inbuilt datetime functions allows for greater flexibility in how your data is displayed.

Helpful guide to strftime()/strptime() shortcuts:
- `%a` - shortened version of weekday (i.e. Wed)
- `%A` - long version of weekday (i.e. Wednesday)
- `%d` - day of the month in number form (i.e. 30)
- `%b` - shortened name of month (i.e. Aug)
- `%B` - long version of month (i.e. August)
- `%m` - month in number form (i.e. 9)
- `%y` - year in shortened form, without century (i.e. 22)
- `%Y` - year in full form (i.e. 2022)
- `%H` - hour in military time (00 - 23)
- `%I` - hour in analog (00 - 12)
- `%p` - AM/PM
- `%M` - minute (00 - 59)
- `%S` - second (00 - 59)
- `%f` - microsecond

In [239]:
# convert datetime object to string
y = y.strftime('%A %B %d, %Y %I:%M %p')
print(y)
print(type(y))

Monday August 28, 2023 02:00 PM
<class 'str'>

In [240]:
# convert string to datetime object
y = dt.datetime.strptime(y,'%A %B %d, %Y %I:%M %p')
print(y)
print(type(y))

2023-08-28 14:00:00
<class 'datetime.datetime'>

**EXERCISE** Calculate the difference of now versus your birthday. Print out the result.

In [241]:
# EXERCISE -- calculate the difference of now versus your birthday

### **Adding Columns to DataFrame**

Adding columns to a dataframe is as simple as naming the new column and setting it equal to a collection.

In [242]:
# create a new column from an ndarray
df['d'] = np.array([79,83,99,90,76])

In [243]:
display(df)

    a    b   c   d
1  80   80  66  79
2  75   85  75  83
3  70   90  91  99
4  90   95  72  90
5  98  100  83  76

###### **Dropping Columns from DataFrame**

To drop a column, you need to use the `df.drop()` function and specify that the axis=1. To ensure that your dataframe keeps the change that you made you either want to set it to a variable or use inplace = True.

In [244]:
# this function creates a shallow copy of the dataframe where b is removed
msft.drop('Adj Close', axis=1)

            Date        Open        High         Low       Close      Volume
0     1986-03-13    0.088542    0.101563    0.088542    0.097222  1031788800
1     1986-03-14    0.097222    0.102431    0.097222    0.100694   308160000
2     1986-03-17    0.100694    0.103299    0.100694    0.102431   133171200
3     1986-03-18    0.102431    0.103299    0.098958    0.099826    67766400
4     1986-03-19    0.099826    0.100694    0.097222    0.098090    47894400
...          ...         ...         ...         ...         ...         ...
9078  2022-03-18  295.369995  301.000000  292.730011  300.429993    43317000
9079  2022-03-21  298.890015  300.140015  294.899994  299.160004    28351200
9080  2022-03-22  299.799988  305.000000  298.769989  304.059998    27599700
9081  2022-03-23  300.510010  303.230011  297.720001  299.489990    25715400
9082  2022-03-24  299.140015  304.200012  298.320007  304.100006    24446900

[9083 rows x 6 columns]

###### **Merging DataFrames Together**

There are two ways to merge data with Pandas:

- `pd.concat()` - stack additional data
- `df.merge()` - database-style merge

The type of merge you use depends upon the data that you're merging. 

If you have rows or columns that align, then `pd.concat()` is the best function to use because it stacks the data together.

If you have datasets with a common key or value or index, then `pd.merge()` is the best function to use to achieve that relation.

In [245]:
# data sets to merge
df_2 = pd.DataFrame({'e': [63,84,76,28,81], 'f':[67,80,73,66,89]}, index=[1,2,3,4,5])

df_3 = pd.DataFrame({'a':100,'b': 100, 'c': 100, 'd': 100, 'e': 100, 'f': 100}, index=[6])

In [246]:
df_2

    e   f
1  63  67
2  84  80
3  76  73
4  28  66
5  81  89

In [247]:
df_3

     a    b    c    d    e    f
6  100  100  100  100  100  100

In [248]:
# inner join - index is the common key
df_final = df.merge(df_2,left_index=True,right_index=True)
display(df_final)

    a    b   c   d   e   f
1  80   80  66  79  63  67
2  75   85  75  83  84  80
3  70   90  91  99  76  73
4  90   95  72  90  28  66
5  98  100  83  76  81  89

In [249]:
# stacking on additional data to the bottom of the data frame
df_final = pd.concat([df_final,df_3])
display(df_final)

     a    b    c    d    e    f
1   80   80   66   79   63   67
2   75   85   75   83   84   80
3   70   90   91   99   76   73
4   90   95   72   90   28   66
5   98  100   83   76   81   89
6  100  100  100  100  100  100

###### **Reshaping DataFrames**

Sometimes data is not in the ideal shape we would like for it to be. There are three main functions to deal with reshaping:

`.T` - transpose dataframe - switch rows and columns

`.pivot()` - converting from long to wide formats

`.melt()` - converting from wide to long formats

In [250]:
#create employee dataset
emp_data = [['Tom', 20, 19, '07/06/2021'],
       ['Steven', 15, 18, '08/05/2022'],
       ['Gianna', 23, 22, '06/25/2021'],
       ['Karina', 25, 21, '07/01/2021']]

emp = pd.DataFrame(emp_data, columns=['Name','$/Hr','Age','Start Date'], index=[1,2,3,4])
display(emp)

     Name  $/Hr  Age  Start Date
1     Tom    20   19  07/06/2021
2  Steven    15   18  08/05/2022
3  Gianna    23   22  06/25/2021
4  Karina    25   21  07/01/2021

In [251]:
# displaying T functionality
display(emp.T)

                     1           2           3           4
Name               Tom      Steven      Gianna      Karina
$/Hr                20          15          23          25
Age                 19          18          22          21
Start Date  07/06/2021  08/05/2022  06/25/2021  07/01/2021

In [252]:
#create student dataset
stu_data = [['Sam','Bachelors', 21],
            ['Christian', 'Graduated', 22],
            ['Mafu', 'Graduated', 23],
            ['Vivek','Masters', 22],
            ['Keva', 'Bachelors', 19],
            ['Thi', 'Masters', 25]]

stud = pd.DataFrame(stu_data, columns=['A','B','C'])
display(stud)

           A          B   C
0        Sam  Bachelors  21
1  Christian  Graduated  22
2       Mafu  Graduated  23
3      Vivek    Masters  22
4       Keva  Bachelors  19
5        Thi    Masters  25

In [253]:
# display .pivot() functionality
display(stud.pivot('A','B','C'))
#empty values are filled with NaNs

B          Bachelors  Graduated  Masters
A
Christian        NaN       22.0      NaN
Keva            19.0        NaN      NaN
Mafu             NaN       23.0      NaN
Sam             21.0        NaN      NaN
Thi              NaN        NaN     25.0
Vivek            NaN        NaN     22.0

In [254]:
#rename the columns
stud.rename(columns={'A':'Name', 'B': 'Status', 'C': 'Age'}, inplace=True)
display(stud)

        Name     Status  Age
0        Sam  Bachelors   21
1  Christian  Graduated   22
2       Mafu  Graduated   23
3      Vivek    Masters   22
4       Keva  Bachelors   19
5        Thi    Masters   25

In [255]:
# display .melt() functionality
display(stud.melt(id_vars=['Name'], value_vars=['Status']))

        Name variable      value
0        Sam   Status  Bachelors
1  Christian   Status  Graduated
2       Mafu   Status  Graduated
3      Vivek   Status    Masters
4       Keva   Status  Bachelors
5        Thi   Status    Masters

### Functions and DataFrames

##### **Descriptive Statistics**

Remember mean, median, and mode? Well, those are all examples of descriptive statistics or easy information about the dataset you're looking at. Pandas has inbuilt functions to streamline this process for dataframes - the most useful of which is `df.describe()`.

Let's re-examine our df_final dataframe:

In [256]:
display(msft)

,Date,Open,High,Low,Close,Adj Close,Volume
0,1986-03-13,0.088542,0.101563,0.088542,0.097222,0.061434,1031788800
1,1986-03-14,0.097222,0.102431,0.097222,0.100694,0.063628,308160000
2,1986-03-17,0.100694,0.103299,0.100694,0.102431,0.064725,133171200
3,1986-03-18,0.102431,0.103299,0.098958,0.099826,0.063079,67766400
4,1986-03-19,0.099826,0.100694,0.097222,0.098090,0.061982,47894400
...,...,...,...,...,...,...,...
9078,2022-03-18,295.369995,301.000000,292.730011,300.429993,300.429993,43317000
9079,2022-03-21,298.890015,300.140015,294.899994,299.160004,299.160004,28351200
9080,2022-03-22,299.799988,305.000000,298.769989,304.059998,304.059998,27599700
9081,2022-03-23,300.510010,303.230011,297.720001,299.489990,299.489990,25715400
9082,2022-03-24,299.140015,304.200012,298.320007,304.100006,304.100006,24446900

In [257]:
# applying df.describe() to df_final
msft.describe()

,Open,High,Low,Close,Adj Close,Volume
count,9083.000000,9083.000000,9083.000000,9083.000000,9083.000000,9.083000e+03
mean,41.324936,41.760887,40.878488,41.335628,36.256120,5.875055e+07
std,59.696905,60.272218,59.081728,59.714567,59.981436,3.845200e+07
min,0.088542,0.092014,0.088542,0.090278,0.057046,2.304000e+06
25%,4.050781,4.102051,4.027344,4.075195,2.575089,3.461230e+07
50%,26.820000,27.100000,26.520000,26.840000,18.948530,5.203200e+07
75%,40.034999,40.443751,39.500000,39.937500,29.244812,7.265400e+07
max,344.619995,349.670013,342.200012,343.109985,342.402008,1.031789e+09

You can very easily get each of these statistics by themselves by using ."statistic"(). 

Furthermore, you can specify how to apply these functions:
- `axis=0` means by column, going through each row (default) - think vertical (up -> down)
- `axis=1` means by row, going through each column - think horizontal (left -> right)

These functions output a Series object.

In [258]:
# compute averages for each student
msft.mean()

/var/folders/sj/3jvs639d20s87vbcgt_m3yc40000gn/T/ipykernel_84222/1563997374.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  msft.mean()

Open         4.132494e+01
High         4.176089e+01
Low          4.087849e+01
Close        4.133563e+01
Adj Close    3.625612e+01
Volume       5.875055e+07
dtype: float64

##### **GroupBy**

Pandas' GroupBy function mimics SQL's in that it boils down to conducting three processes at once:
- Grouping data according to specified criteria (i.e. category)
- Applying a function to each specified group
- Combining the results into a data structure 

To write a successful GroupBy, you need to have three specifications present:
- A DataFrame or Series
- .groupby method with grouping specifications
- function being applied to each grouping

There are 4 ways to group the observations in a pandas data structure (Series or DataFrame):

1. By a sequence of values that is the same length as the axis being grouped
2. By a DataFrame column name (DataFrame only)**
3. By a dictionary or Series giving a correspondence between the values on the axis being grouped and the group names
4. By the results of a function call invoked on the axis index or the individual labels in the index

** This is the method we will be covering and is the most common practice

In [259]:
# create a new dataframe
form = pd.DataFrame({'date': ['08/24/2022','08/24/2022','08/24/2022','08/24/2022','08/24/2022','08/24/2022','08/24/2022','08/24/2022','08/24/2022','08/24/2022'],'time': ['Morning', 'Morning', 'Evening', 'Afternoon','Morning','Afternoon','Evening','Evening','Evening','Morning'], 'pandas': [5,5,4,3,2,4,4,1,2,3], 'numpy': [5,4,4,3,2,3,4,4,2,3]})

display(form)

         date       time  pandas  numpy
0  08/24/2022    Morning       5      5
1  08/24/2022    Morning       5      4
2  08/24/2022    Evening       4      4
3  08/24/2022  Afternoon       3      3
4  08/24/2022    Morning       2      2
5  08/24/2022  Afternoon       4      3
6  08/24/2022    Evening       4      4
7  08/24/2022    Evening       1      4
8  08/24/2022    Evening       2      2
9  08/24/2022    Morning       3      3

**--THOUGHT EXERCISE--**

What kinds of groups can we make with this data? What types of functions can we apply to get insight about this data?

In [260]:
# creating a group for time
# you can also group multiple columns by using a list
grouped = form.groupby(by='time')
grouped

In [261]:
# let's see the frequency of each group 
grouped.size()

time
Afternoon    2
Evening      4
Morning      4
dtype: int64

In [262]:
# let's look into one specific group in particular
grouped.get_group('Evening')

         date     time  pandas  numpy
2  08/24/2022  Evening       4      4
6  08/24/2022  Evening       4      4
7  08/24/2022  Evening       1      4
8  08/24/2022  Evening       2      2

**EXERCISE**

What is another way we can get the same dataframe generated above?

In [263]:
# Enter Answer

**EXERCISE**

Calculate the average expertise level of NumPy and Pandas amongst the time grouping.

In [264]:
# Enter Answer

##### **Applying Functions to a DataFrame** - df.apply() and df.applymap()

`df.apply()` is the easiest way to apply your own custom function to entire rows and/or columns (this includes lambdas and inbuilt functions!). 

`df.applymap()` applies function to each element in a dataframe.

You can once again specify rows or columns by using 
axis=0 (column) or axis=1 (row) for `df.apply()`.

In [265]:
# reloading df_final
display(df_final)

     a    b    c    d    e    f
1   80   80   66   79   63   67
2   75   85   75   83   84   80
3   70   90   91   99   76   73
4   90   95   72   90   28   66
5   98  100   83   76   81   89
6  100  100  100  100  100  100

In [266]:
# calculate the percentage weight of each student's test score to the their total points
df_final.apply(lambda x: x/x.sum()*100, axis=0)

           a          b          c          d          e          f
1  15.594542  14.545455  13.552361  14.990512  14.583333  14.105263
2  14.619883  15.454545  15.400411  15.749526  19.444444  16.842105
3  13.645224  16.363636  18.685832  18.785579  17.592593  15.368421
4  17.543860  17.272727  14.784394  17.077799   6.481481  13.894737
5  19.103314  18.181818  17.043121  14.421252  18.750000  18.736842
6  19.493177  18.181818  20.533881  18.975332  23.148148  21.052632

In [267]:
# make the test scores display as percentages
df_final.applymap(lambda x: f'{x}%')

      a     b     c     d     e     f
1   80%   80%   66%   79%   63%   67%
2   75%   85%   75%   83%   84%   80%
3   70%   90%   91%   99%   76%   73%
4   90%   95%   72%   90%   28%   66%
5   98%  100%   83%   76%   81%   89%
6  100%  100%  100%  100%  100%  100%

##### **Conditional Functions** - np.where()

`np.where()` is a powerful function enables the power to essentially embody a `if...then...else...` in one singular statement. It can be applied to any type of collection.

Here's the anatomy of this function:

np.where(condition, result_if_true, result_if_false)

In [268]:
# let's flag all the tests that are below a certain score as retake
df_final.apply(lambda x: np.where(x < 65, 'Retake', ' ------- '))

           a          b          c          d          e          f
1   -------    -------    -------    -------      Retake   -------
2   -------    -------    -------    -------    -------    -------
3   -------    -------    -------    -------    -------    -------
4   -------    -------    -------    -------      Retake   -------
5   -------    -------    -------    -------    -------    -------
6   -------    -------    -------    -------    -------    -------

##### **Masking/Filtering**

Masking refers to hiding values based upon a condition. We can do this with dataframes by using `df[condition]` or with arrays by using `arr[condition]`.

In [269]:
df_final[df_final >= 90]

       a      b      c      d      e      f
1    NaN    NaN    NaN    NaN    NaN    NaN
2    NaN    NaN    NaN    NaN    NaN    NaN
3    NaN   90.0   91.0   99.0    NaN    NaN
4   90.0   95.0    NaN   90.0    NaN    NaN
5   98.0  100.0    NaN    NaN    NaN    NaN
6  100.0  100.0  100.0  100.0  100.0  100.0

In [270]:
# returns index where statement is true
print(df_final[df_final['a'] == 100])

     a    b    c    d    e    f
6  100  100  100  100  100  100

## <a name="snek"></a>Making Things Pythonic

##### **Lambda Expressions**

Lambda expressions are single-expressioned anonymous functions that can take any series of arguments. They're very useful if you have that one quick thing that you want to do with a function.

In [271]:
# A Lambda Expression that returns the square of the sum of any two numbers
def myFunction(a, b):
    return (a+b) **2

print("Typical Function example: ", myFunction(1, 3))

x = lambda a,b : (a+b)**2
print("Using Lambda: ", x(1,3))

Typical Function example:  16
Using Lambda:  16

##### **List Comprehensions**

List comprehensions help create a new list based on the values of an existing list/range (essentially do the job of a for loop for any iterable).

Here's the anatomy of a list comprehension in written form, but my personal favorite guide to writing them is the image below:

new_list = [output for x in iterable if condition]

![image.png]()

In [272]:
# A list that records every instance of "python" in coding_langs as "snek"
coding_langs = ['java', 'python', 'c++', 'python', 'cobol', 'javascript', 'c#', 'python', 'sql', 'python']
sneky = ['snek' for x in coding_langs if x == 'python']

print(sneky)

['snek', 'snek', 'snek', 'snek']

You can also do an if, else statement with a list comprehension.

In [273]:
# A list that changes every instance of "python" in coding_langs as "snek"
coding_langs = ['java', 'python', 'c++', 'python', 'cobol', 'javascript', 'c#', 'python', 'sql', 'python']
sneky = ['snek' if x == 'python' else x for x in coding_langs]

print(sneky)

['java', 'snek', 'c++', 'snek', 'cobol', 'javascript', 'c#', 'snek', 'sql', 'snek']

## Summing it Up

##### **Putting it all together - exercise 1**

a) create a DataFrame from the following dictionary that documents the weekly weather in Bethesda, MD; all highs and lows are in Fahrenheit (data courtesy of wunderground.com)

`{'date':['07/31/2022','08/01/2022','08/02/2022','08/03/2022','08/04/2022','08/05/2022','08/06/2022'], 'high': [85,89,92,91,94,91,88], 'low': [72,73,72,75,74,74,74], 'precipitation (in inches)': [0.00,0.48,0.51,0.00,0.00,0.93,0.00]}`

b) print out the dataframe

c) convert all of the dates in the dataframe to datetime objects

d) analyze the data


> i) What day of the week had the highest high? What day of the week had the lowest high? What was the difference in time between the two? (you should get a timedelta object for this question)

> ii) Take a look at the precipitation - what is the average precipitation for the week?

> iii) Add on the following data:

`pd.Series({'date': '08/07/2022', 'high': 89, 'low': 76, 'precipitation (in inches)': 0.00)`

> iv) Filter the dataframe to see the days with the highs greater than or equal to 90

> v) Graph the highs for each day with the appropriate graph. **BE SURE TO INCLUDE TITLE AND LEGENDS**.

In [274]:
# Enter Answer - a

In [275]:
# Enter Answer - b

In [276]:
# Enter Answer - c

In [277]:
# Enter Answer - d(i)

In [278]:
# Enter Answer - d(ii)

In [279]:
# Enter Answer - d(iii)

In [280]:
# Enter Answer - d(iv)

In [281]:
# Enter Answer - d(v)